# Exercise 2

## Pandas

In [208]:
import pandas as pd
import numpy as np

1. Load the file 'worldcities.csv' from last tutorial (https://simplemaps.com/data/world-cities) as a pd.DataFrame and display the first 5 rows

In [ ]:
# WRITE CODE HERE

In [209]:
# DON'T EXECUTE THIS CELL

,city,city_ascii,lat,lng,country,iso2,iso3,admin_name,capital,population,id
0,Tokyo,Tokyo,35.6897,139.6922,Japan,JP,JPN,Tōkyō,primary,37732000.0,1392685764
1,Jakarta,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,Jakarta,primary,33756000.0,1360771077
2,Delhi,Delhi,28.6100,77.2300,India,IN,IND,Delhi,admin,32226000.0,1356872604
3,Guangzhou,Guangzhou,23.1300,113.2600,China,CN,CHN,Guangdong,admin,26940000.0,1156237133
4,Mumbai,Mumbai,19.0761,72.8775,India,IN,IND,Mahārāshtra,admin,24973000.0,1356226629

2. How many cities are there?

In [ ]:
# WRITE CODE HERE

In [210]:
# DON'T EXECUTE THIS CELL

44691

3. Determine how many missing inputs there are in each column

In [ ]:
# WRITE CODE HERE

In [211]:
# DON'T EXECUTE THIS CELL

city              0
city_ascii        0
lat               0
lng               0
country           0
iso2             33
iso3              0
admin_name      316
capital       33553
population      307
id                0
dtype: int64

4. Drop the columns 'city_ascii', 'admin_name', 'capital', 'id', which we will not need in the following and display the **last** 5 rows

In [ ]:
# WRITE CODE HERE

In [212]:
# DON'T EXECUTE THIS CELL

              city      lat       lng    country iso2 iso3  population
44686        Numto  63.6667   71.3333     Russia   RU  RUS        10.0
44687         Nord  81.7166  -17.8000  Greenland   GL  GRL        10.0
44688  Timmiarmiut  62.5333  -42.2167  Greenland   GL  GRL        10.0
44689   San Rafael -16.7795  -60.6799    Bolivia   BO  BOL         NaN
44690      Nordvik  74.0165  111.5100     Russia   RU  RUS         0.0

5. Now remove the cities with no numerical value in the 'population' column. How many cities are left?

In [ ]:
# WRITE CODE HERE

In [213]:
# DON'T EXECUTE THIS CELL

44384

6. Display the city with the largest population as pd.Series

In [ ]:
# WRITE CODE HERE

In [214]:
# DON'T EXECUTE THIS CELL

city               Tokyo
lat              35.6897
lng             139.6922
country            Japan
iso2                  JP
iso3                 JPN
population    37732000.0
Name: 0, dtype: object

7. How many countries are present in the data and how many people are included in the data?

In [ ]:
# WRITE CODE HERE

In [215]:
# DON'T EXECUTE THIS CELL

(230, 5076372338)

8. Create a list "countries_few" of countries that have less than $n$ cities (at least in the data). Order them alphabetically (use $n = 3$)

In [ ]:
# WRITE CODE HERE

In [216]:
# DON'T EXECUTE THIS CELL

['American Samoa',
 'Antigua and Barbuda',
 'Aruba',
 'Barbados',
 'Bermuda',
 'British Virgin Islands',
 'Cayman Islands',
 'Cook Islands',
 'Curaçao',
 'Dominica',
 'Falkland Islands (Islas Malvinas)',
 'French Polynesia',
 'Gibraltar',
 'Grenada',
 'Guadeloupe',
 'Guam',
 'Isle Of Man',
 'Jersey',
 'Kiribati',
 'Macau',
 'Marshall Islands',
 'Martinique',
 'Mayotte',
 'Monaco',
 'Montserrat',
 'Niue',
 'Northern Mariana Islands',
 'Reunion',
 'Saint Helena, Ascension, and Tristan da Cunha',
 'Saint Kitts and Nevis',
 'Saint Martin',
 'Saint Vincent and the Grenadines',
 'Seychelles',
 'Singapore',
 'Sint Maarten',
 'South Georgia and South Sandwich Islands',
 'Tonga',
 'Turks and Caicos Islands',
 'Tuvalu',
 'Vatican City']

9. Redefine our pd.DataFrame to contain only countries that are not in "countries_few", i.e. that have $\geq n$ cities

In [ ]:
# WRITE CODE HERE

In [217]:
# DON'T EXECUTE THIS CELL

              city      lat       lng    country iso2 iso3  population
0            Tokyo  35.6897  139.6922      Japan   JP  JPN  37732000.0
1          Jakarta  -6.1750  106.8275  Indonesia   ID  IDN  33756000.0
2            Delhi  28.6100   77.2300      India   IN  IND  32226000.0
3        Guangzhou  23.1300  113.2600      China   CN  CHN  26940000.0
4           Mumbai  19.0761   72.8775      India   IN  IND  24973000.0
...            ...      ...       ...        ...  ...  ...         ...
44685       Tukchi  57.3670  139.5000     Russia   RU  RUS        10.0
44686        Numto  63.6667   71.3333     Russia   RU  RUS        10.0
44687         Nord  81.7166  -17.8000  Greenland   GL  GRL        10.0
44688  Timmiarmiut  62.5333  -42.2167  Greenland   GL  GRL        10.0
44690      Nordvik  74.0165  111.5100     Russia   RU  RUS         0.0

[44335 rows x 7 columns]

10. Compute the mean, median and standard deviation of the population **per country** and display the result in descending order w.r.t the mean

In [ ]:
# WRITE CODE HERE

In [256]:
# DON'T EXECUTE THIS CELL

                                       mean    median        std
country
China                              911694.5   77277.0  2037950.7
Kuwait                             736592.2  164212.0  1272481.9
United Arab Emirates               640793.2  104811.0   990113.5
South Korea                        616318.8  210004.0  2331384.5
Nigeria                            578965.6  221142.5  1664792.4
...                                     ...       ...        ...
Bonaire, Sint Eustatius, and Saba    4040.0    1038.0     5705.7
San Marino                           4023.9    3056.5     3347.8
Liechtenstein                        3505.2    4404.0     1934.9
Faroe Islands                        2849.0     446.0     4890.3
Greenland                            2059.0     746.5     3948.0

[190 rows x 3 columns]

11. Create columns 'Greenwich' and 'Equator' where the inputs 'W'/'E' and 'N'/'S' correspond to a city being in the west/east of the Greenwich meridian and north/south of the Equator line (use the columns 'lat', 'lng' for this)

In [ ]:
# WRITE CODE HERE

In [219]:
# DON'T EXECUTE THIS CELL

,city,lat,lng,country,iso2,iso3,population,Greenwich,Equator
0,Tokyo,35.6897,139.6922,Japan,JP,JPN,37732000.0,E,N
1,Jakarta,-6.1750,106.8275,Indonesia,ID,IDN,33756000.0,E,S
2,Delhi,28.6100,77.2300,India,IN,IND,32226000.0,E,N
3,Guangzhou,23.1300,113.2600,China,CN,CHN,26940000.0,E,N
4,Mumbai,19.0761,72.8775,India,IN,IND,24973000.0,E,N
...,...,...,...,...,...,...,...,...,...
44685,Tukchi,57.3670,139.5000,Russia,RU,RUS,10.0,E,N
44686,Numto,63.6667,71.3333,Russia,RU,RUS,10.0,E,N
44687,Nord,81.7166,-17.8000,Greenland,GL,GRL,10.0,W,N
44688,Timmiarmiut,62.5333,-42.2167,Greenland,GL,GRL,10.0,W,N
44690,Nordvik,74.0165,111.5100,Russia,RU,RUS,0.0,E,N

12. Create a dictonary for the 4 different combinations $\{'E', 'W'\} \times \{'N', 'S'\}$ or quadrants with the respective amount of cities located in these quadrants

In [239]:
# WRITE CODE HERE

In [239]:
# DON'T EXECUTE THIS CELL

{('E', 'N'): 25706, ('E', 'S'): 2306, ('W', 'N'): 12248, ('W', 'S'): 4075}

13. Similarly, create a dictonary with the amount of people for each quadrant

In [244]:
# WRITE CODE HERE

In [244]:
# DON'T EXECUTE THIS CELL

{('E', 'N'): 3568040297,
 ('E', 'S'): 280300161,
 ('W', 'N'): 900316539,
 ('W', 'S'): 319072020}